# Dasha Davis, 7.14.2 DataFrames, pg. 267

In [1]:
#Creating a DataFrame from a Dictionary

In [2]:
importa pandas as pd

SyntaxError: invalid syntax (1644136058.py, line 1)

In [3]:
#let's try again, but without the typo

import pandas as pd

In [4]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 
               'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 
               'Bob': [83, 65, 85]}

In [5]:
grades = pd.DataFrame(grades_dict)

grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [6]:
# oooohhhh. That's beautiful!!!! 
# indices are left aligned in the index column, remaining columns values are right aligned.
# Dictionaries keys become the column names and the values associated with each key become the element 
# values in the corresponding column

## Creating custome indices, instead of the default (0, 1, 2...) using the 'index' keyword

In [7]:
# pg. 267

In [8]:
#using the 'index attribute'

In [9]:
grades.index = ['Test1', 'Test2', 'Test3']

grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [10]:
#this could have been done when creating the dataframe by 
#pd.DataFrame(grades_dict, index=['Test1', 'Test2', 'Test3'])

## Dasha Davis You might get a ValueError if there are NOT the same number of elements as there are rows

In [11]:
# Series also provides an index attribute for changing an existing Sereis' indices

In [12]:
#Accessing a DataFrame's Columns

In [13]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [14]:
grades.Sam  #if column-name strings are valid Python identifiers, you can use them as attributes
#also if there are no spaces in the key - can use the easier '.'(dot) attribute approach

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

## Selecting Rows via the loc (locate) and iloc Attributes, p. 268

In [17]:
#loc attribute to find Test1 of all the students

In [16]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [18]:
#Dasha Davis can also access rows by using the integer based indices - iloc (yes, I can!)

In [20]:
grades.iloc[1] #this is 2nd row

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

In [21]:
#I prefer the loc because it seems more straight-forward and easier as long as there are custom indices

In [22]:
#Accessing specific cell by row and column, p. 270

In [23]:
#use dataframes at and iat attributes to get a single value from a DataFrame. 
#the row and column indices must be separated by a comma

In [24]:
grades.at['Test2', 'Eva']

87

In [25]:
#Dasha Davis tries to reverse the order to see what happens?

In [26]:
grades.at['Eva', 'Test2']

KeyError: 'Test2'

In [27]:
# Python didn't like that! Dasha - remember - ROWS MUST COME FIRST, THEN COLUMNS

In [28]:
grades.iat[2,0]

70

In [29]:
#let's try an original one - find Katie's Test2 grade

In [30]:
grades.iat[1,3]

81

In [31]:
#Awesome. I understand this.

In [32]:
#when there is not SO MUCH to do, I have time to play around and explore a little :)

In [33]:
#Descriptive Statistics

grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [34]:
#woah! So cool! OMG. I love this.

In [35]:
#control the precision of the floating-point values, so not to display with 6 points of precision.

In [36]:
pd.set_option('precision', 2)

grades.describe()

OptionError: 'Pattern matched multiple keys'

In [37]:
#nope. That didn't work. Let's try the other option

In [40]:
pd.set_option("display.precision", 2) #this would have worked with the space after the comma if I'd added
# grades.describe() 
#the suggestion in the assignment was missing a space after the comma.

In [41]:
#let's try again.

pandas.set_option("display.precision", 2) #pandas spelled out came directly from a Google search

NameError: name 'pandas' is not defined

In [45]:
#let's try again.

pandas.set_option("display.precision", 2)

grades.describe() #I forgot to put this last time

NameError: name 'pandas' is not defined

In [43]:
#let's try again...

pd.set_option("display.precision", 2)

grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [44]:
#silent dance party

In [46]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [47]:
# Sorting rows in reverse order, pg. 272

In [48]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [49]:
#sorting columns - alphabetical for strings - (ascending order, left to right)

In [50]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70

# Dasha Davis

In [52]:
# Sorting by Column Values, p273, by using 'sort_values'

In [53]:
# in this case, Test1, highest scores to lowest scores in the columns

In [54]:
grades.sort_values(by='Test1', axis=1, ascending=False)

       Eva  Katie  Sam  Wally  Bob
Test1  100    100   94     87   83
Test2   87     81   77     96   65
Test3   90     82   90     70   85

In [55]:
#or we can transpose the DataFrame, but putting names as rows and tests as columns

In [56]:
grades.T.sort_values(by='Test1', ascending=False)

       Test1  Test2  Test3
Eva      100     87     90
Katie    100     81     82
Sam       94     77     90
Wally     87     96     70
Bob       83     65     85

In [57]:
#maybe I only want to see Test 1 and not the other data

grades.loc['Test1'].sort_values(ascending=False)

Eva      100
Katie    100
Sam       94
Wally     87
Bob       83
Name: Test1, dtype: int64

# Self-Check, pg. 274, 7.14.2

In [59]:
import pandas as pd

temps = {'Mon': [68, 89], 'Tue': [71, 93], 'Wed': [66, 82], 'Thu': [75, 97], 'Fri': [62, 79]}

tempertures = pd.DataFrame(temps, index=['Low', 'High']) #(a)

In [60]:
temperatures # (a)

NameError: name 'temperatures' is not defined

In [ ]:
#ha! I see the error in my ways - spelled temperatures wrong the first time

In [62]:
import pandas as pd

temps = {'Mon': [68, 89], 'Tue': [71, 93], 'Wed': [66, 82], 'Thu': [75, 97], 'Fri': [62, 79]}

temperatures = pd.DataFrame(temps, index=['Low', 'High']) #(a)

In [63]:
temperatures

      Mon  Tue  Wed  Thu  Fri
Low    68   71   66   75   62
High   89   93   82   97   79

In [64]:
temperatures.loc[:, 'Mon':'Wed']

      Mon  Tue  Wed
Low    68   71   66
High   89   93   82

In [65]:
tempertures.loc['Low']

Mon    68
Tue    71
Wed    66
Thu    75
Fri    62
Name: Low, dtype: int64

In [66]:
#to set precision

In [67]:
pd.set_option("display.precision", 2)

temperatures.mean()

Mon    78.5
Tue    82.0
Wed    74.0
Thu    86.0
Fri    70.5
dtype: float64

In [68]:
temperatures.mean(axis=1)

Low     68.4
High    88.0
dtype: float64

# Dasha Davis - End of Self-Check 7.14.2